# CADExportOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CADExportOptions Class
Members See Also
---
Generic CAD Export options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class CADExportOptions
```

Visual Basic
---
```text
Public MustInherit Class CADExportOptions
```

Visual C++
---
```text
public ref class CADExportOptions abstract
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..CADExportOptions Autodesk.Revit.DB..::..DWFExportOptions
# See Also
CADExportOptions Members
Autodesk.Revit.DB Namespace